In [1]:
from sqlalchemy import create_engine
from config import db_password
import pandas as pd
##Must create config.py file with db_password = YourPassword for this to work. 
##Check gitignore includes .py files. Do not commit config.py. Check with git status
##Must match name of your database (FinalProject)
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/FinalProject"

In [2]:
#Create database engine
engine = create_engine(db_string)
#Error message? Uncomment and run the following cell, then re-run this one

In [3]:
#pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/envs/mlenv/lib/python3.7/site-packages (2.9.3)
Note: you may need to restart the kernel to use updated packages.

In [11]:
#Import input data
inputDf = pd.read_csv("../Resources/Education_Data_Cleaned.csv")

#Set index as year to get rid of unnecessary index col.
inputDf = inputDf.set_index(["State"])
inputDf.head()

,YEAR,Less_than_9th_ grade,9th_to_12th_grade_no_diploma,High_school_graduate_(includes_equivalency),"Some_college,_no_degree",Associates_degree,Bachelors_degree,Graduate_or_professional_degree,Population
State,,,,,,,,,
Alabama,2010.0,195566.0,369310.0,988205.0,690363.0,225382.0,439863.0,252832.0,3163531.0
Alaska,2010.0,12708.0,27668.0,114055.0,133217.0,37106.0,83346.0,42477.0,452587.0
Arizona,2010.0,261461.0,333890.0,1040197.0,1100225.0,336950.0,691889.0,382146.0,4148768.0
Arkansas,2010.0,121504.0,205920.0,664076.0,432193.0,121711.0,252888.0,121130.0,1921432.0
California,2010.0,2534951.0,2115091.0,5012413.0,5351807.0,1831667.0,4610875.0,2640396.0,24099210.0

In [16]:
#Import output data
outputDf = pd.read_csv("../Resources/Personal Income.csv")

#Set index as GeoName to get rid of unnecessary index col.
outputDf = outputDf.set_index(["GeoName"])
outputDf.head()

,Description,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
GeoName,,,,,,,,,,,
Alabama,Personal income (thousands of dollars),162531112,168474324,173361655,175185262,181078773,189115437,192363456,199336413,207053583,215930375
Alaska,Personal income (thousands of dollars),35451983,37981757,39265976,38978032,41209955,42555117,41837407,42497120,44102675,45293853
Arizona,Personal income (thousands of dollars),216873648,227700087,237809058,243752324,257272272,270815540,282085147,297904910,315732186,334023910
Arkansas,Personal income (thousands of dollars),94576076,100739246,107877287,108367763,114743300,118719486,121825917,125779938,130865194,135302690
California,Personal income (thousands of dollars),1614040770,1715226969,1827166863,1857200859,1980736837,2125430316,2218457774,2318644417,2431821953,2544234978

In [17]:
# Turn Dataframes to sql using engine created above.
# Put data into tables inputData and outputData
inputDf.to_sql(name="inputdata", con=engine)
outputDf.to_sql(name="outputdata", con=engine)

#You should now have data in these two tables!